src/main/resources/requests/affordabilityprepopulationservice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:aff="http://affordabilityprepopulationservice/">
    <soapenv:Header/>
    <soapenv:Body>
        <aff:AmendDeclaredIncome>
            <!--Optional:-->
            <aff:cifKey>${cifKey}</aff:cifKey>
            <!--Optional:-->
            <aff:incomeAmendment>
                <!--Optional:-->
                <aff:NetSalaryIncomeMonth1>${NetSalaryIncomeMonth1}</aff:NetSalaryIncomeMonth1>
                <!--Optional:-->
                <aff:NetSalaryIncomeMonth2>${NetSalaryIncomeMonth2}</aff:NetSalaryIncomeMonth2>
                <!--Optional:-->
                <aff:NetSalaryIncomeMonth3>${NetSalaryIncomeMonth3}</aff:NetSalaryIncomeMonth3>
                <!--Optional:-->
                <aff:NetSalaryIncomeAverage>${NetSalaryIncomeAverage}</aff:NetSalaryIncomeAverage>
                <!--Optional:-->
                <aff:SalaryDeductions>?</aff:SalaryDeductions>
                <!--Optional:-->
                <aff:SalaryAdjustments>?</aff:SalaryAdjustments>
                <!--Optional:-->
                <aff:GrossIncome>${GrossIncome}</aff:GrossIncome>
                <!--Optional:-->
                <aff:NettIncome>${NettIncome}</aff:NettIncome>
                <!--Optional:-->
                <aff:MonthlyRentalIncome>?</aff:MonthlyRentalIncome>
                <!--Optional:-->
                <aff:OtherAdditionalIncome>?</aff:OtherAdditionalIncome>
                <!--Optional:-->
                <aff:OtherAdditionaIncomeDescription>?</aff:OtherAdditionaIncomeDescription>
                <!--Optional:-->
                <aff:Channel></aff:Channel>
                <!--Optional:-->
                <aff:Product>?</aff:Product>
                <!--Optional:-->
                <aff:Site>?</aff:Site>
                <!--Optional:-->
                <aff:ApplicationReference></aff:ApplicationReference>
            </aff:incomeAmendment>
        </aff:AmendDeclaredIncome>
    </soapenv:Body>
</soapenv:Envelope>